; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-5-8-5)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	p0-1 - location
	p1-2 - location
	p1-6 - location
	p2-0 - location
	p2-4 - location
	p2-5 - location
	p3-1 - location
	p5-1 - location
	p5-7 - location
	p6-3 - location
	p6-4 - location
	p7-0 - location
	p7-2 - location
	p7-8 - location
	p8-1 - location
	p8-3 - location
	p8-7 - location
	p8-9 - location
	p9-1 - location
	p9-2 - location
	p9-4 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s4)
	(at driver3 s6)
	(at driver4 s6)
	(at driver5 s2)
	(at truck1 s6)
	(empty truck1)
	(at truck2 s0)
	(empty truck2)
	(at truck3 s3)
	(empty truck3)
	(at truck4 s5)
	(empty truck4)
	(at truck5 s1)
	(empty truck5)
	(at truck6 s4)
	(empty truck6)
	(at truck7 s5)
	(empty truck7)
	(at truck8 s5)
	(empty truck8)
	(at package1 s8)
	(at package2 s7)
	(at package3 s8)
	(at package4 s5)
	(at package5 s3)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 31)
	(= (time-to-walk p0-1 s0) 31)
	(= (time-to-walk s1 p0-1) 78)
	(= (time-to-walk p0-1 s1) 78)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 46)
	(= (time-to-walk p1-2 s1) 46)
	(= (time-to-walk s2 p1-2) 45)
	(= (time-to-walk p1-2 s2) 45)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(= (time-to-walk s1 p1-6) 88)
	(= (time-to-walk p1-6 s1) 88)
	(= (time-to-walk s6 p1-6) 23)
	(= (time-to-walk p1-6 s6) 23)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 63)
	(= (time-to-walk p2-0 s2) 63)
	(= (time-to-walk s0 p2-0) 31)
	(= (time-to-walk p2-0 s0) 31)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(= (time-to-walk s2 p2-4) 45)
	(= (time-to-walk p2-4 s2) 45)
	(= (time-to-walk s4 p2-4) 21)
	(= (time-to-walk p2-4 s4) 21)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(= (time-to-walk s2 p2-5) 82)
	(= (time-to-walk p2-5 s2) 82)
	(= (time-to-walk s5 p2-5) 12)
	(= (time-to-walk p2-5 s5) 12)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(= (time-to-walk s3 p3-1) 81)
	(= (time-to-walk p3-1 s3) 81)
	(= (time-to-walk s1 p3-1) 36)
	(= (time-to-walk p3-1 s1) 36)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(= (time-to-walk s5 p5-1) 41)
	(= (time-to-walk p5-1 s5) 41)
	(= (time-to-walk s1 p5-1) 53)
	(= (time-to-walk p5-1 s1) 53)
	(path s5 p5-7)
	(path p5-7 s5)
	(path s7 p5-7)
	(path p5-7 s7)
	(= (time-to-walk s5 p5-7) 24)
	(= (time-to-walk p5-7 s5) 24)
	(= (time-to-walk s7 p5-7) 31)
	(= (time-to-walk p5-7 s7) 31)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(= (time-to-walk s6 p6-3) 7)
	(= (time-to-walk p6-3 s6) 7)
	(= (time-to-walk s3 p6-3) 99)
	(= (time-to-walk p6-3 s3) 99)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(= (time-to-walk s6 p6-4) 49)
	(= (time-to-walk p6-4 s6) 49)
	(= (time-to-walk s4 p6-4) 47)
	(= (time-to-walk p6-4 s4) 47)
	(path s7 p7-0)
	(path p7-0 s7)
	(path s0 p7-0)
	(path p7-0 s0)
	(= (time-to-walk s7 p7-0) 80)
	(= (time-to-walk p7-0 s7) 80)
	(= (time-to-walk s0 p7-0) 27)
	(= (time-to-walk p7-0 s0) 27)
	(path s7 p7-2)
	(path p7-2 s7)
	(path s2 p7-2)
	(path p7-2 s2)
	(= (time-to-walk s7 p7-2) 73)
	(= (time-to-walk p7-2 s7) 73)
	(= (time-to-walk s2 p7-2) 30)
	(= (time-to-walk p7-2 s2) 30)
	(path s7 p7-8)
	(path p7-8 s7)
	(path s8 p7-8)
	(path p7-8 s8)
	(= (time-to-walk s7 p7-8) 12)
	(= (time-to-walk p7-8 s7) 12)
	(= (time-to-walk s8 p7-8) 10)
	(= (time-to-walk p7-8 s8) 10)
	(path s8 p8-1)
	(path p8-1 s8)
	(path s1 p8-1)
	(path p8-1 s1)
	(= (time-to-walk s8 p8-1) 61)
	(= (time-to-walk p8-1 s8) 61)
	(= (time-to-walk s1 p8-1) 36)
	(= (time-to-walk p8-1 s1) 36)
	(path s8 p8-3)
	(path p8-3 s8)
	(path s3 p8-3)
	(path p8-3 s3)
	(= (time-to-walk s8 p8-3) 26)
	(= (time-to-walk p8-3 s8) 26)
	(= (time-to-walk s3 p8-3) 91)
	(= (time-to-walk p8-3 s3) 91)
	(path s8 p8-9)
	(path p8-9 s8)
	(path s9 p8-9)
	(path p8-9 s9)
	(= (time-to-walk s8 p8-9) 13)
	(= (time-to-walk p8-9 s8) 13)
	(= (time-to-walk s9 p8-9) 71)
	(= (time-to-walk p8-9 s9) 71)
	(path s9 p9-1)
	(path p9-1 s9)
	(path s1 p9-1)
	(path p9-1 s1)
	(= (time-to-walk s9 p9-1) 36)
	(= (time-to-walk p9-1 s9) 36)
	(= (time-to-walk s1 p9-1) 1)
	(= (time-to-walk p9-1 s1) 1)
	(path s9 p9-2)
	(path p9-2 s9)
	(path s2 p9-2)
	(path p9-2 s2)
	(= (time-to-walk s9 p9-2) 94)
	(= (time-to-walk p9-2 s9) 94)
	(= (time-to-walk s2 p9-2) 98)
	(= (time-to-walk p9-2 s2) 98)
	(path s9 p9-4)
	(path p9-4 s9)
	(path s4 p9-4)
	(path p9-4 s4)
	(= (time-to-walk s9 p9-4) 32)
	(= (time-to-walk p9-4 s9) 32)
	(= (time-to-walk s4 p9-4) 38)
	(= (time-to-walk p9-4 s4) 38)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 19)
	(= (time-to-drive s1 s0) 19)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 14)
	(= (time-to-drive s5 s0) 14)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 50)
	(= (time-to-drive s6 s0) 50)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 100)
	(= (time-to-drive s7 s0) 100)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 49)
	(= (time-to-drive s2 s1) 49)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 90)
	(= (time-to-drive s5 s1) 90)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 53)
	(= (time-to-drive s0 s3) 53)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 73)
	(= (time-to-drive s6 s3) 73)
	(link s3 s7)
	(link s7 s3)
	(= (time-to-drive s3 s7) 21)
	(= (time-to-drive s7 s3) 21)
	(link s3 s8)
	(link s8 s3)
	(= (time-to-drive s3 s8) 60)
	(= (time-to-drive s8 s3) 60)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 72)
	(= (time-to-drive s1 s4) 72)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 69)
	(= (time-to-drive s6 s4) 69)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 6)
	(= (time-to-drive s2 s5) 6)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 51)
	(= (time-to-drive s4 s5) 51)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 96)
	(= (time-to-drive s6 s5) 96)
	(link s5 s7)
	(link s7 s5)
	(= (time-to-drive s5 s7) 79)
	(= (time-to-drive s7 s5) 79)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 81)
	(= (time-to-drive s1 s6) 81)
	(link s7 s4)
	(link s4 s7)
	(= (time-to-drive s7 s4) 8)
	(= (time-to-drive s4 s7) 8)
	(link s7 s6)
	(link s6 s7)
	(= (time-to-drive s7 s6) 88)
	(= (time-to-drive s6 s7) 88)
	(link s7 s9)
	(link s9 s7)
	(= (time-to-drive s7 s9) 41)
	(= (time-to-drive s9 s7) 41)
	(link s8 s4)
	(link s4 s8)
	(= (time-to-drive s8 s4) 44)
	(= (time-to-drive s4 s8) 44)
	(link s9 s3)
	(link s3 s9)
	(= (time-to-drive s9 s3) 14)
	(= (time-to-drive s3 s9) 14)
	(link s9 s4)
	(link s4 s9)
	(= (time-to-drive s9 s4) 32)
	(= (time-to-drive s4 s9) 32)
	(link s9 s6)
	(link s6 s9)
	(= (time-to-drive s9 s6) 57)
	(= (time-to-drive s6 s9) 57)
	(link s9 s8)
	(link s8 s9)
	(= (time-to-drive s9 s8) 85)
	(= (time-to-drive s8 s9) 85)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver3 s1)
	(at driver4 s8)
	(at truck1 s8)
	(at truck2 s1)
	(at truck6 s2)
	(at truck7 s6)
	(at truck8 s2)
	(at package1 s8)
	(at package2 s1)
	(at package3 s7)
	(at package4 s8)
	(at package5 s2)
	))

(:metric minimize (+ (+ (* 3  (total-time)) (* 3  (driven))) (* 4  (walked))))

)

; plan
1. (board-truck driver4 truck1 s6)
   deleted: (at driver4 s6) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 1 of 12
2. (walk driver3 s6 p1-6)
   deleted: (at driver3 s6)
   added: (at driver3 p1-6)
   changed: (walked) from 0 to 23
   goals met: 1 of 12
3. (walk driver3 p1-6 s1)
   deleted: (at driver3 p1-6)
   added: (at driver3 s1)
   changed: (walked) from 23 to 111
   goals met: 2 of 12
4. (drive-truck truck1 s6 s0 driver4)
   deleted: (at truck1 s6)
   added: (at truck1 s0)
   changed: (driven) from 0 to 50
   goals met: 2 of 12
5. (board-truck driver2 truck6 s4)
   deleted: (at driver2 s4) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 2 of 12
6. (drive-truck truck6 s4 s5 driver2)
   deleted: (at truck6 s4)
   added: (at truck6 s5)
   changed: (driven) from 50 to 101
   goals met: 2 of 12
7. (drive-truck truck6 s5 s2 driver2)
   deleted: (at truck6 s5)
   added: (at truck6 s2)
   changed: (driven) from 101 to 107
   goals met: 3 of 12
8. (drive-truck truck1 s0 s5 driver4)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   changed: (driven) from 107 to 121
   goals met: 3 of 12
9. (load-truck package4 truck1 s5)
   deleted: (at package4 s5)
   added: (in package4 truck1)
   goals met: 3 of 12
10. (drive-truck truck1 s5 s6 driver4)
   deleted: (at truck1 s5)
   added: (at truck1 s6)
   changed: (driven) from 121 to 217
   goals met: 3 of 12
11. (drive-truck truck1 s6 s9 driver4)
   deleted: (at truck1 s6)
   added: (at truck1 s9)
   changed: (driven) from 217 to 274
   goals met: 3 of 12
12. (drive-truck truck6 s2 s5 driver2)
   deleted: (at truck6 s2)
   added: (at truck6 s5)
   changed: (driven) from 274 to 280
   goals met: 2 of 12
13. (drive-truck truck6 s5 s0 driver2)
   deleted: (at truck6 s5)
   added: (at truck6 s0)
   changed: (driven) from 280 to 294
   goals met: 2 of 12
14. (drive-truck truck1 s9 s8 driver4)
   deleted: (at truck1 s9)
   added: (at truck1 s8)
   changed: (driven) from 294 to 379
   goals met: 3 of 12
15. (unload-truck package4 truck1 s8)
   deleted: (in package4 truck1)
   added: (at package4 s8)
   goals met: 4 of 12
16. (walk driver5 s2 p2-5)
   deleted: (at driver5 s2)
   added: (at driver5 p2-5)
   changed: (walked) from 111 to 193
   goals met: 4 of 12
17. (load-truck package3 truck1 s8)
   deleted: (at package3 s8)
   added: (in package3 truck1)
   goals met: 4 of 12
18. (walk driver5 p2-5 s5)
   deleted: (at driver5 p2-5)
   added: (at driver5 s5)
   changed: (walked) from 193 to 205
   goals met: 4 of 12
19. (disembark-truck driver4 truck1 s8)
   deleted: (driving driver4 truck1)
   added: (at driver4 s8) (empty truck1)
   goals met: 5 of 12
20. (drive-truck truck6 s0 s3 driver2)
   deleted: (at truck6 s0)
   added: (at truck6 s3)
   changed: (driven) from 379 to 432
   goals met: 5 of 12
21. (load-truck package5 truck6 s3)
   deleted: (at package5 s3)
   added: (in package5 truck6)
   goals met: 5 of 12
22. (unload-truck package3 truck1 s8)
   deleted: (in package3 truck1)
   added: (at package3 s8)
   goals met: 5 of 12
23. (drive-truck truck6 s3 s0 driver2)
   deleted: (at truck6 s3)
   added: (at truck6 s0)
   changed: (driven) from 432 to 485
   goals met: 5 of 12
24. (board-truck driver5 truck8 s5)
   deleted: (at driver5 s5) (empty truck8)
   added: (driving driver5 truck8)
   goals met: 5 of 12
25. (drive-truck truck8 s5 s2 driver5)
   deleted: (at truck8 s5)
   added: (at truck8 s2)
   changed: (driven) from 485 to 491
   goals met: 6 of 12
26. (drive-truck truck6 s0 s7 driver2)
   deleted: (at truck6 s0)
   added: (at truck6 s7)
   changed: (driven) from 491 to 591
   goals met: 6 of 12
27. (load-truck package2 truck6 s7)
   deleted: (at package2 s7)
   added: (in package2 truck6)
   goals met: 6 of 12
28. (drive-truck truck6 s7 s5 driver2)
   deleted: (at truck6 s7)
   added: (at truck6 s5)
   changed: (driven) from 591 to 670
   goals met: 6 of 12
29. (load-truck package3 truck1 s8)
   deleted: (at package3 s8)
   added: (in package3 truck1)
   goals met: 6 of 12
30. (drive-truck truck6 s5 s2 driver2)
   deleted: (at truck6 s5)
   added: (at truck6 s2)
   changed: (driven) from 670 to 676
   goals met: 7 of 12
31. (unload-truck package5 truck6 s2)
   deleted: (in package5 truck6)
   added: (at package5 s2)
   goals met: 8 of 12
32. (drive-truck truck6 s2 s1 driver2)
   deleted: (at truck6 s2)
   added: (at truck6 s1)
   changed: (driven) from 676 to 725
   goals met: 7 of 12
33. (board-truck driver4 truck1 s8)
   deleted: (at driver4 s8) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 6 of 12
34. (unload-truck package2 truck6 s1)
   deleted: (in package2 truck6)
   added: (at package2 s1)
   goals met: 7 of 12
35. (drive-truck truck6 s1 s2 driver2)
   deleted: (at truck6 s1)
   added: (at truck6 s2)
   changed: (driven) from 725 to 774
   goals met: 8 of 12
36. (walk driver3 s1 p0-1)
   deleted: (at driver3 s1)
   added: (at driver3 p0-1)
   changed: (walked) from 205 to 283
   goals met: 7 of 12
37. (walk driver3 p0-1 s0)
   deleted: (at driver3 p0-1)
   added: (at driver3 s0)
   changed: (walked) from 283 to 314
   goals met: 7 of 12
38. (board-truck driver3 truck2 s0)
   deleted: (at driver3 s0) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 7 of 12
39. (drive-truck truck2 s0 s1 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (driven) from 774 to 793
   goals met: 8 of 12
40. (disembark-truck driver3 truck2 s1)
   deleted: (driving driver3 truck2)
   added: (at driver3 s1) (empty truck2)
   goals met: 9 of 12
41. (drive-truck truck1 s8 s9 driver4)
   deleted: (at truck1 s8)
   added: (at truck1 s9)
   changed: (driven) from 793 to 878
   goals met: 8 of 12
42. (drive-truck truck6 s2 s5 driver2)
   deleted: (at truck6 s2)
   added: (at truck6 s5)
   changed: (driven) from 878 to 884
   goals met: 7 of 12
43. (drive-truck truck1 s9 s8 driver4)
   deleted: (at truck1 s9)
   added: (at truck1 s8)
   changed: (driven) from 884 to 969
   goals met: 8 of 12
44. (disembark-truck driver2 truck6 s5)
   deleted: (driving driver2 truck6)
   added: (at driver2 s5) (empty truck6)
   goals met: 8 of 12
45. (drive-truck truck1 s8 s3 driver4)
   deleted: (at truck1 s8)
   added: (at truck1 s3)
   changed: (driven) from 969 to 1029
   goals met: 7 of 12
46. (board-truck driver2 truck6 s5)
   deleted: (at driver2 s5) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 7 of 12
47. (drive-truck truck6 s5 s2 driver2)
   deleted: (at truck6 s5)
   added: (at truck6 s2)
   changed: (driven) from 1029 to 1035
   goals met: 8 of 12
48. (walk driver3 s1 p5-1)
   deleted: (at driver3 s1)
   added: (at driver3 p5-1)
   changed: (walked) from 314 to 367
   goals met: 7 of 12
49. (walk driver3 p5-1 s5)
   deleted: (at driver3 p5-1)
   added: (at driver3 s5)
   changed: (walked) from 367 to 408
   goals met: 7 of 12
50. (board-truck driver3 truck7 s5)
   deleted: (at driver3 s5) (empty truck7)
   added: (driving driver3 truck7)
   goals met: 7 of 12
51. (drive-truck truck1 s3 s8 driver4)
   deleted: (at truck1 s3)
   added: (at truck1 s8)
   changed: (driven) from 1035 to 1095
   goals met: 8 of 12
52. (disembark-truck driver4 truck1 s8)
   deleted: (driving driver4 truck1)
   added: (at driver4 s8) (empty truck1)
   goals met: 9 of 12
53. (unload-truck package3 truck1 s8)
   deleted: (in package3 truck1)
   added: (at package3 s8)
   goals met: 9 of 12
54. (drive-truck truck7 s5 s4 driver3)
   deleted: (at truck7 s5)
   added: (at truck7 s4)
   changed: (driven) from 1095 to 1146
   goals met: 9 of 12
55. (drive-truck truck7 s4 s8 driver3)
   deleted: (at truck7 s4)
   added: (at truck7 s8)
   changed: (driven) from 1146 to 1190
   goals met: 9 of 12
56. (drive-truck truck7 s8 s9 driver3)
   deleted: (at truck7 s8)
   added: (at truck7 s9)
   changed: (driven) from 1190 to 1275
   goals met: 9 of 12
57. (disembark-truck driver3 truck7 s9)
   deleted: (driving driver3 truck7)
   added: (at driver3 s9) (empty truck7)
   goals met: 9 of 12
58. (walk driver3 s9 p9-1)
   deleted: (at driver3 s9)
   added: (at driver3 p9-1)
   changed: (walked) from 408 to 444
   goals met: 9 of 12
59. (load-truck package3 truck1 s8)
   deleted: (at package3 s8)
   added: (in package3 truck1)
   goals met: 9 of 12
60. (board-truck driver4 truck1 s8)
   deleted: (at driver4 s8) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 8 of 12
61. (walk driver3 p9-1 s9)
   deleted: (at driver3 p9-1)
   added: (at driver3 s9)
   changed: (walked) from 444 to 480
   goals met: 8 of 12
62. (drive-truck truck1 s8 s3 driver4)
   deleted: (at truck1 s8)
   added: (at truck1 s3)
   changed: (driven) from 1275 to 1335
   goals met: 7 of 12
63. (board-truck driver3 truck7 s9)
   deleted: (at driver3 s9) (empty truck7)
   added: (driving driver3 truck7)
   goals met: 7 of 12
64. (drive-truck truck1 s3 s7 driver4)
   deleted: (at truck1 s3)
   added: (at truck1 s7)
   changed: (driven) from 1335 to 1356
   goals met: 7 of 12
65. (unload-truck package3 truck1 s7)
   deleted: (in package3 truck1)
   added: (at package3 s7)
   goals met: 8 of 12
66. (drive-truck truck1 s7 s9 driver4)
   deleted: (at truck1 s7)
   added: (at truck1 s9)
   changed: (driven) from 1356 to 1397
   goals met: 8 of 12
67. (disembark-truck driver3 truck7 s9)
   deleted: (driving driver3 truck7)
   added: (at driver3 s9) (empty truck7)
   goals met: 8 of 12
68. (walk driver3 s9 p9-1)
   deleted: (at driver3 s9)
   added: (at driver3 p9-1)
   changed: (walked) from 480 to 516
   goals met: 8 of 12
69. (disembark-truck driver4 truck1 s9)
   deleted: (driving driver4 truck1)
   added: (at driver4 s9) (empty truck1)
   goals met: 8 of 12
70. (board-truck driver4 truck7 s9)
   deleted: (at driver4 s9) (empty truck7)
   added: (driving driver4 truck7)
   goals met: 8 of 12
71. (drive-truck truck7 s9 s8 driver4)
   deleted: (at truck7 s9)
   added: (at truck7 s8)
   changed: (driven) from 1397 to 1482
   goals met: 8 of 12
72. (walk driver3 p9-1 s9)
   deleted: (at driver3 p9-1)
   added: (at driver3 s9)
   changed: (walked) from 516 to 552
   goals met: 8 of 12
73. (board-truck driver3 truck1 s9)
   deleted: (at driver3 s9) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 8 of 12
74. (drive-truck truck1 s9 s4 driver3)
   deleted: (at truck1 s9)
   added: (at truck1 s4)
   changed: (driven) from 1482 to 1514
   goals met: 8 of 12
75. (drive-truck truck1 s4 s1 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   changed: (driven) from 1514 to 1586
   goals met: 8 of 12
76. (drive-truck truck7 s8 s9 driver4)
   deleted: (at truck7 s8)
   added: (at truck7 s9)
   changed: (driven) from 1586 to 1671
   goals met: 8 of 12
77. (drive-truck truck7 s9 s6 driver4)
   deleted: (at truck7 s9)
   added: (at truck7 s6)
   changed: (driven) from 1671 to 1728
   goals met: 9 of 12
78. (disembark-truck driver4 truck7 s6)
   deleted: (driving driver4 truck7)
   added: (at driver4 s6) (empty truck7)
   goals met: 9 of 12
79. (drive-truck truck1 s1 s4 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   changed: (driven) from 1728 to 1800
   goals met: 9 of 12
80. (drive-truck truck1 s4 s8 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s8)
   changed: (driven) from 1800 to 1844
   goals met: 10 of 12
81. (disembark-truck driver3 truck1 s8)
   deleted: (driving driver3 truck1)
   added: (at driver3 s8) (empty truck1)
   goals met: 10 of 12
82. (walk driver3 s8 p8-1)
   deleted: (at driver3 s8)
   added: (at driver3 p8-1)
   changed: (walked) from 552 to 613
   goals met: 10 of 12
83. (walk driver4 s6 p1-6)
   deleted: (at driver4 s6)
   added: (at driver4 p1-6)
   changed: (walked) from 613 to 636
   goals met: 10 of 12
84. (walk driver3 p8-1 s1)
   deleted: (at driver3 p8-1)
   added: (at driver3 s1)
   changed: (walked) from 636 to 672
   goals met: 11 of 12
85. (walk driver4 p1-6 s1)
   deleted: (at driver4 p1-6)
   added: (at driver4 s1)
   changed: (walked) from 672 to 760
   goals met: 11 of 12
86. (walk driver4 s1 p8-1)
   deleted: (at driver4 s1)
   added: (at driver4 p8-1)
   changed: (walked) from 760 to 796
   goals met: 11 of 12
87. (walk driver4 p8-1 s8)
   deleted: (at driver4 p8-1)
   added: (at driver4 s8)
   changed: (walked) from 796 to 857
   goals met: 12 of 12
